---
kind: property
id: P:Autodesk.Revit.DB.FaceDetailNode.LineProperties
source: html/9edceebc-052f-adf2-8fcf-b5f9ff39a479.htm
---
# Autodesk.Revit.DB.FaceDetailNode.LineProperties Property

Access to the line (pen) properties of the curve being drawn.

## Syntax (C#)
```csharp
public LineProperties LineProperties { get; }
```